project/atropos-c/cases/mysql-cases/concurrency-case/front_1/parties-5.log
sysbench 1.1.0-f698960 (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 4
Report intermediate results every 1.000000 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 1.0s ] thds: 4 tps: 15.88 qps: 381.06 (r/w/o: 277.86/67.48/35.72) lat (ms,95%): 314.45 err/s: 0.00 reconn/s: 0.00
[ 2.0s ] thds: 4 tps: 0.00 qps: 0.00 (r/w/o: 0.00/0.00/0.00) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 3.0s ] thds: 4 tps: 0.00 qps: 0.00 (r/w/o: 0.00/0.00/0.00) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 4.0s ] thds: 4 tps: 16.00 qps: 318.00 (r/w/o: 224.00/62.00/32.00) lat (ms,95%): 2728.81 err/s: 0.00 reconn/s: 0.00
[ 5.0s ] thds: 4 tps: 19.00 qps: 383.99 (r/w/o: 265.99/80.00/38.00) lat (ms,95%): 3511.19 err/s: 0.00 reconn/s: 0.00
[ 6.0s ] thds: 4 tps: 30.02 qps: 593.40 (r/w/o: 417.28/116.08/60.04) lat (ms,95%): 719.92 err/s: 0.00 reconn/s: 0.00
[ 7.0s ] thds: 4 tps: 48.97 qps: 970.35 (r/w/o: 678.55/193.87/97.93) lat (ms,95%): 204.11 err/s: 0.00 reconn/s: 0.00
[ 8.0s ] thds: 4 tps: 68.00 qps: 1340.97 (r/w/o: 932.98/271.99/136.00) lat (ms,95%): 110.66 err/s: 0.00 reconn/s: 0.00
[ 9.0s ] thds: 4 tps: 53.20 qps: 1099.15 (r/w/o: 773.92/218.83/106.40) lat (ms,95%): 142.39 err/s: 0.00 reconn/s: 0.00
[ 10.0s ] thds: 4 tps: 65.91 qps: 1306.26 (r/w/o: 916.78/257.66/131.82) lat (ms,95%): 123.28 err/s: 0.00 reconn/s: 0.00
[ 11.0s ] thds: 4 tps: 54.00 qps: 1095.98 (r/w/o: 761.99/226.00/108.00) lat (ms,95%): 116.80 err/s: 0.00 reconn/s: 0.00
[ 12.0s ] thds: 4 tps: 57.04 qps: 1105.70 (r/w/o: 769.49/222.14/114.07) lat (ms,95%): 173.58 err/s: 0.00 reconn/s: 0.00
[ 13.0s ] thds: 4 tps: 41.94 qps: 877.76 (r/w/o: 616.13/177.75/83.88) lat (ms,95%): 282.25 err/s: 0.00 reconn/s: 0.00
[ 14.0s ] thds: 4 tps: 60.91 qps: 1196.14 (r/w/o: 840.69/233.64/121.81) lat (ms,95%): 123.28 err/s: 0.00 reconn/s: 0.00
[ 15.0s ] thds: 4 tps: 49.12 qps: 990.40 (r/w/o: 699.69/192.47/98.24) lat (ms,95%): 183.21 err/s: 0.00 reconn/s: 0.00
[ 16.0s ] thds: 4 tps: 51.91 qps: 1044.27 (r/w/o: 726.80/213.65/103.83) lat (ms,95%): 223.34 err/s: 0.00 reconn/s: 0.00
[ 17.0s ] thds: 4 tps: 60.98 qps: 1212.69 (r/w/o: 846.78/243.94/121.97) lat (ms,95%): 125.52 err/s: 0.00 reconn/s: 0.00
[ 18.0s ] thds: 4 tps: 56.97 qps: 1152.39 (r/w/o: 804.58/233.88/113.94) lat (ms,95%): 137.35 err/s: 0.00 reconn/s: 0.00
[ 19.0s ] thds: 4 tps: 55.21 qps: 1082.12 (r/w/o: 759.90/211.81/110.42) lat (ms,95%): 132.49 err/s: 0.00 reconn/s: 0.00
[ 20.0s ] thds: 4 tps: 57.78 qps: 1158.63 (r/w/o: 806.95/236.11/115.56) lat (ms,95%): 139.85 err/s: 0.00 reconn/s: 0.00
[ 21.0s ] thds: 4 tps: 61.99 qps: 1228.87 (r/w/o: 862.91/242.97/122.99) lat (ms,95%): 200.47 err/s: 0.00 reconn/s: 0.00
[ 22.0s ] thds: 4 tps: 70.05 qps: 1420.03 (r/w/o: 997.72/281.20/141.10) lat (ms,95%): 112.67 err/s: 0.00 reconn/s: 0.00
[ 23.0s ] thds: 4 tps: 38.12 qps: 769.44 (r/w/o: 536.70/156.50/76.24) lat (ms,95%): 411.96 err/s: 0.00 reconn/s: 0.00
[ 24.0s ] thds: 4 tps: 75.72 qps: 1501.45 (r/w/o: 1053.11/296.90/151.44) lat (ms,95%): 101.13 err/s: 0.00 reconn/s: 0.00
[ 25.0s ] thds: 4 tps: 59.21 qps: 1177.11 (r/w/o: 821.87/236.83/118.41) lat (ms,95%): 215.44 err/s: 0.00 reconn/s: 0.00
[ 26.0s ] thds: 4 tps: 49.01 qps: 986.20 (r/w/o: 686.14/203.04/97.02) lat (ms,95%): 144.97 err/s: 0.00 reconn/s: 0.00
[ 27.0s ] thds: 4 tps: 44.83 qps: 891.66 (r/w/o: 630.64/170.36/90.66) lat (ms,95%): 179.94 err/s: 0.00 reconn/s: 0.00
[ 28.0s ] thds: 4 tps: 39.10 qps: 778.91 (r/w/o: 539.32/161.40/78.19) lat (ms,95%): 164.45 err/s: 0.00 reconn/s: 0.00
[ 29.0s ] thds: 4 tps: 40.01 qps: 825.29 (r/w/o: 579.20/166.06/80.03) lat (ms,95%): 173.58 err/s: 0.00 reconn/s: 0.00
[ 30.0s ] thds: 4 tps: 50.05 qps: 991.90 (r/w/o: 695.63/196.18/100.09) lat (ms,95%): 155.80 err/s: 0.00 reconn/s: 0.00
[ 31.0s ] thds: 4 tps: 48.01 qps: 951.12 (r/w/o: 668.09/187.02/96.01) lat (ms,95%): 173.58 err/s: 0.00 reconn/s: 0.00
[ 32.0s ] thds: 4 tps: 50.00 qps: 1008.90 (r/w/o: 702.93/205.98/99.99) lat (ms,95%): 155.80 err/s: 0.00 reconn/s: 0.00
[ 33.0s ] thds: 4 tps: 40.84 qps: 821.81 (r/w/o: 576.76/163.37/81.68) lat (ms,95%): 227.40 err/s: 0.00 reconn/s: 0.00
[ 34.0s ] thds: 4 tps: 58.22 qps: 1153.46 (r/w/o: 806.11/230.89/116.45) lat (ms,95%): 130.13 err/s: 0.00 reconn/s: 0.00
[ 35.0s ] thds: 4 tps: 37.00 qps: 736.03 (r/w/o: 517.02/145.01/74.00) lat (ms,95%): 176.73 err/s: 0.00 reconn/s: 0.00
[ 36.0s ] thds: 4 tps: 46.88 qps: 936.67 (r/w/o: 658.36/184.54/93.77) lat (ms,95%): 227.40 err/s: 0.00 reconn/s: 0.00
[ 37.0s ] thds: 4 tps: 39.03 qps: 787.68 (r/w/o: 553.47/156.13/78.07) lat (ms,95%): 176.73 err/s: 0.00 reconn/s: 0.00
[ 38.0s ] thds: 4 tps: 44.01 qps: 870.22 (r/w/o: 606.15/176.04/88.02) lat (ms,95%): 204.11 err/s: 0.00 reconn/s: 0.00
[ 39.0s ] thds: 4 tps: 37.03 qps: 753.67 (r/w/o: 525.47/154.14/74.07) lat (ms,95%): 253.35 err/s: 0.00 reconn/s: 0.00
[ 40.0s ] thds: 4 tps: 31.89 qps: 634.82 (r/w/o: 443.48/127.56/63.78) lat (ms,95%): 179.94 err/s: 0.00 reconn/s: 0.00
[ 41.0s ] thds: 4 tps: 40.16 qps: 801.18 (r/w/o: 563.24/157.63/80.32) lat (ms,95%): 646.19 err/s: 0.00 reconn/s: 0.00
[ 42.0s ] thds: 4 tps: 42.83 qps: 841.69 (r/w/o: 583.71/172.32/85.66) lat (ms,95%): 223.34 err/s: 0.00 reconn/s: 0.00
[ 43.0s ] thds: 4 tps: 34.13 qps: 706.73 (r/w/o: 499.93/138.53/68.26) lat (ms,95%): 337.94 err/s: 0.00 reconn/s: 0.00
[ 44.0s ] thds: 4 tps: 48.00 qps: 956.10 (r/w/o: 670.07/190.02/96.01) lat (ms,95%): 142.39 err/s: 0.00 reconn/s: 0.00
[ 45.0s ] thds: 4 tps: 46.00 qps: 909.91 (r/w/o: 633.93/183.98/91.99) lat (ms,95%): 158.63 err/s: 0.00 reconn/s: 0.00
[ 46.0s ] thds: 4 tps: 48.82 qps: 990.34 (r/w/o: 696.43/196.27/97.64) lat (ms,95%): 257.95 err/s: 0.00 reconn/s: 0.00
[ 47.0s ] thds: 4 tps: 32.99 qps: 643.89 (r/w/o: 446.92/130.98/65.99) lat (ms,95%): 308.84 err/s: 0.00 reconn/s: 0.00
[ 48.0s ] thds: 4 tps: 49.17 qps: 971.31 (r/w/o: 678.31/194.66/98.34) lat (ms,95%): 235.74 err/s: 0.00 reconn/s: 0.00
[ 49.0s ] thds: 4 tps: 46.88 qps: 956.55 (r/w/o: 667.29/195.50/93.76) lat (ms,95%): 170.48 err/s: 0.00 reconn/s: 0.00
[ 50.0s ] thds: 4 tps: 51.04 qps: 1015.70 (r/w/o: 717.49/196.13/102.07) lat (ms,95%): 155.80 err/s: 0.00 reconn/s: 0.00
[ 51.0s ] thds: 4 tps: 50.93 qps: 1005.58 (r/w/o: 698.01/205.71/101.86) lat (ms,95%): 170.48 err/s: 0.00 reconn/s: 0.00
[ 52.0s ] thds: 4 tps: 38.15 qps: 790.05 (r/w/o: 556.15/157.61/76.29) lat (ms,95%): 215.44 err/s: 0.00 reconn/s: 0.00
[ 53.0s ] thds: 4 tps: 45.94 qps: 886.75 (r/w/o: 620.12/174.75/91.87) lat (ms,95%): 267.41 err/s: 0.00 reconn/s: 0.00
[ 54.0s ] thds: 4 tps: 41.05 qps: 848.12 (r/w/o: 600.79/165.22/82.11) lat (ms,95%): 240.02 err/s: 0.00 reconn/s: 0.00
[ 55.0s ] thds: 4 tps: 45.88 qps: 916.58 (r/w/o: 636.32/188.50/91.76) lat (ms,95%): 161.51 err/s: 0.00 reconn/s: 0.00
[ 56.0s ] thds: 4 tps: 35.96 qps: 690.21 (r/w/o: 480.45/137.84/71.92) lat (ms,95%): 390.30 err/s: 0.00 reconn/s: 0.00
[ 57.0s ] thds: 4 tps: 46.17 qps: 953.55 (r/w/o: 669.49/191.71/92.34) lat (ms,95%): 150.29 err/s: 0.00 reconn/s: 0.00
[ 58.0s ] thds: 4 tps: 43.85 qps: 857.08 (r/w/o: 600.95/168.43/87.70) lat (ms,95%): 173.58 err/s: 0.00 reconn/s: 0.00
[ 59.0s ] thds: 4 tps: 50.04 qps: 1012.73 (r/w/o: 710.51/202.14/100.07) lat (ms,95%): 211.60 err/s: 0.00 reconn/s: 0.00
[ 60.0s ] thds: 4 tps: 49.14 qps: 982.81 (r/w/o: 683.95/200.57/98.28) lat (ms,95%): 161.51 err/s: 0.00 reconn/s: 0.00
[ 61.0s ] thds: 4 tps: 48.93 qps: 973.59 (r/w/o: 685.01/190.72/97.86) lat (ms,95%): 189.93 err/s: 0.00 reconn/s: 0.00
[ 62.0s ] thds: 4 tps: 34.92 qps: 711.31 (r/w/o: 496.82/144.66/69.83) lat (ms,95%): 196.89 err/s: 0.00 reconn/s: 0.00
[ 63.0s ] thds: 4 tps: 49.03 qps: 969.55 (r/w/o: 679.39/192.11/98.06) lat (ms,95%): 139.85 err/s: 0.00 reconn/s: 0.00
[ 64.0s ] thds: 4 tps: 38.08 qps: 771.57 (r/w/o: 537.09/158.32/76.15) lat (ms,95%): 170.48 err/s: 0.00 reconn/s: 0.00
[ 65.0s ] thds: 4 tps: 36.04 qps: 727.80 (r/w/o: 511.56/144.16/72.08) lat (ms,95%): 292.60 err/s: 0.00 reconn/s: 0.00
[ 66.0s ] thds: 4 tps: 49.81 qps: 982.25 (r/w/o: 686.38/196.25/99.62) lat (ms,95%): 173.58 err/s: 0.00 reconn/s: 0.00
[ 67.0s ] thds: 4 tps: 41.00 qps: 822.10 (r/w/o: 579.07/161.02/82.01) lat (ms,95%): 183.21 err/s: 0.00 reconn/s: 0.00
[ 68.0s ] thds: 4 tps: 55.09 qps: 1095.78 (r/w/o: 764.24/221.36/110.18) lat (ms,95%): 204.11 err/s: 0.00 reconn/s: 0.00
[ 69.0s ] thds: 4 tps: 40.93 qps: 823.60 (r/w/o: 579.02/162.72/81.86) lat (ms,95%): 173.58 err/s: 0.00 reconn/s: 0.00
[ 70.0s ] thds: 4 tps: 40.15 qps: 806.05 (r/w/o: 565.14/160.61/80.30) lat (ms,95%): 248.83 err/s: 0.00 reconn/s: 0.00
[ 71.0s ] thds: 4 tps: 50.81 qps: 1010.17 (r/w/o: 703.33/205.22/101.61) lat (ms,95%): 125.52 err/s: 0.00 reconn/s: 0.00
[ 72.0s ] thds: 4 tps: 40.16 qps: 800.12 (r/w/o: 556.17/163.64/80.31) lat (ms,95%): 272.27 err/s: 0.00 reconn/s: 0.00
[ 73.0s ] thds: 4 tps: 58.94 qps: 1149.88 (r/w/o: 803.22/228.78/117.88) lat (ms,95%): 153.02 err/s: 0.00 reconn/s: 0.00
[ 74.0s ] thds: 4 tps: 29.98 qps: 647.54 (r/w/o: 461.68/125.91/59.96) lat (ms,95%): 369.77 err/s: 0.00 reconn/s: 0.00
[ 75.0s ] thds: 4 tps: 43.06 qps: 861.22 (r/w/o: 602.86/172.24/86.12) lat (ms,95%): 137.35 err/s: 0.00 reconn/s: 0.00
[ 76.0s ] thds: 4 tps: 44.89 qps: 885.78 (r/w/o: 614.46/181.55/89.78) lat (ms,95%): 308.84 err/s: 0.00 reconn/s: 0.00
[ 77.0s ] thds: 4 tps: 51.14 qps: 1010.81 (r/w/o: 709.97/198.55/102.28) lat (ms,95%): 173.58 err/s: 0.00 reconn/s: 0.00
[ 78.0s ] thds: 4 tps: 45.89 qps: 914.76 (r/w/o: 637.44/185.55/91.77) lat (ms,95%): 158.63 err/s: 0.00 reconn/s: 0.00
[ 79.0s ] thds: 4 tps: 49.96 qps: 1010.13 (r/w/o: 712.39/197.83/99.91) lat (ms,95%): 200.47 err/s: 0.00 reconn/s: 0.00
[ 80.0s ] thds: 4 tps: 56.11 qps: 1107.13 (r/w/o: 770.48/224.43/112.22) lat (ms,95%): 123.28 err/s: 0.00 reconn/s: 0.00
[ 81.0s ] thds: 4 tps: 19.02 qps: 398.32 (r/w/o: 282.23/78.06/38.03) lat (ms,95%): 733.00 err/s: 0.00 reconn/s: 0.00
[ 82.0s ] thds: 4 tps: 52.03 qps: 1035.51 (r/w/o: 724.36/207.10/104.05) lat (ms,95%): 207.82 err/s: 0.00 reconn/s: 0.00
[ 83.0s ] thds: 4 tps: 35.86 qps: 702.26 (r/w/o: 486.10/144.44/71.72) lat (ms,95%): 164.45 err/s: 0.00 reconn/s: 0.00
[ 84.0s ] thds: 4 tps: 44.08 qps: 896.54 (r/w/o: 636.09/172.30/88.15) lat (ms,95%): 297.92 err/s: 0.00 reconn/s: 0.00
[ 85.0s ] thds: 4 tps: 46.03 qps: 915.53 (r/w/o: 635.37/188.11/92.05) lat (ms,95%): 142.39 err/s: 0.00 reconn/s: 0.00
[ 86.0s ] thds: 4 tps: 37.06 qps: 758.29 (r/w/o: 539.92/144.25/74.13) lat (ms,95%): 164.45 err/s: 0.00 reconn/s: 0.00
[ 87.0s ] thds: 4 tps: 45.85 qps: 914.96 (r/w/o: 635.89/187.38/91.70) lat (ms,95%): 144.97 err/s: 0.00 reconn/s: 0.00
[ 88.0s ] thds: 4 tps: 46.15 qps: 920.94 (r/w/o: 643.05/185.59/92.29) lat (ms,95%): 186.54 err/s: 0.00 reconn/s: 0.00
[ 89.0s ] thds: 4 tps: 55.96 qps: 1126.21 (r/w/o: 792.44/221.84/111.92) lat (ms,95%): 144.97 err/s: 0.00 reconn/s: 0.00
[ 90.0s ] thds: 4 tps: 38.88 qps: 776.63 (r/w/o: 537.36/161.51/77.76) lat (ms,95%): 235.74 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            56574
        write:                           16164
        other:                           8082
        total:                           80820
    transactions:                        4041   (44.85 per sec.)
    queries:                             80820  (897.03 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      44.8516
    time elapsed:                        90.0971s
    total number of events:              4041

Latency (ms):
         min:                                   23.95
         avg:                                   89.11
         max:                                 3988.74
         95th percentile:                      189.93
         sum:                               360103.13

Threads fairness:
    events (avg/stddev):           1010.2500/12.23
    execution time (avg/stddev):   90.0258/0.04